arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/drivers/src/rtc/fsl_rtc_driver.c
/*
 * Copyright (c) 2014 - 2016, Freescale Semiconductor, Inc.
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of Freescale Semiconductor, Inc. nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include "fsl_rtc_driver.h"

/*!< Table of RTC base pointers */
RTC_Type *      g_rtcBase[]         = RTC_BASE_PTRS;

/*!< Table of RTC IRQ Numbers */
extern IRQn_Type       g_rtcIrqNumbers[];
/*!< Table of RTC Second IRQ Numbers */
extern IRQn_Type       g_rtcSecondsIrqNb[];

/*!
 * @brief static RTC runtime structure, it is designed only for internal
 * purposes such as storing interrupt configuration for each instance.
 */
static struct _rtc_runtime_t
{
    rtc_alarm_config_t          * alarmConfig;    /*!< Alarm configuration     */
    bool                          isAlarmTimeNew; /* Check if there is a 
                                                   * new alarm                 */
    rtc_interrupt_config_t      * intConfig;      /*!< Interrupt configuration */
    rtc_seconds_int_config_t    * secondsIntConfig;
                                                  /*!< Time seconds interrupt
                                                   * configuration
                                                   */
} g_rtcRuntimeConfig[RTC_INSTANCE_COUNT];


/*******************************************************************************
 * Code
 ******************************************************************************/

/*FUNCTION**********************************************************************
 *
 * Function Name RTC_DRV_Init
 * Description   This function initializes the RTC instance with the settings
 * provided by the user via the rtcUserCfg parameter. The user must ensure that
 * clock is enabled for the RTC instance used. If the Control register is locked
 * then this method returns RTC_STATUS_LOCKED. In order to clear the CR Lock
 * the user must perform a power-on reset.
 * Return        RTC_STAT_SUCCESS if the operation was successful, RTC_STAT_ERROR
 *               if there was a problem or RTC_STATUS_LOCKED if at least one
 *               register is locked
 *
 *END**************************************************************************/
rtc_status_t RTC_DRV_Init(uint8_t instance,
                            rtc_init_config_t * const rtcUserCfg)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < RTC_INSTANCE_COUNT)
#endif

    rtc_status_t statusCode = RTC_STAT_SUCCESS;

    /* Check if the configuration is valid */
    if(rtcUserCfg == NULL)
    {
        /* If not, return error status */
        statusCode = RTC_STAT_ERROR;
    }
    else
    {
        /* Initialize runtime structure */
        g_rtcRuntimeConfig[instance].alarmConfig        = NULL;
        g_rtcRuntimeConfig[instance].intConfig          = NULL;
        g_rtcRuntimeConfig[instance].secondsIntConfig   = NULL;
        g_rtcRuntimeConfig[instance].isAlarmTimeNew     = false;

        RTC_Type * basePtr = g_rtcBase[instance];

        /* Check if the control register is locked. If true, the method cannot
         * continue.
         */
        if(RTC_HAL_isRegisterLocked
                             (basePtr, RTC_CTRL_REG_LOCK) == true)
        {
            statusCode = RTC_STAT_LOCKED;
        }
        else
        {
            /* Disable the RTC instance IRQ to perform a software reset */
            INT_SYS_DisableIRQ(g_rtcIrqNumbers[instance]);
            /* Perform a software reset */
            RTC_HAL_SetSoftwareReset(basePtr);
            RTC_HAL_ClearSoftwareReset(basePtr);
            /* Initialize the RTC Instance */
            statusCode = RTC_HAL_Init(basePtr);

            /* Clear the pending interrupt generated by the software reset */
            INT_SYS_ClearPending(g_rtcIrqNumbers[instance]);

            /* Setup the RTC instance as configured in the structure */
            RTC_HAL_SetClockPinEnable(basePtr,  rtcUserCfg->clockPinCfg);
            RTC_HAL_SetOscLoadConfig(basePtr,   rtcUserCfg->oscLoadCfg);
            RTC_HAL_SetClockOutput(basePtr,     rtcUserCfg->clkOutEnable);
            RTC_HAL_SetClockPinSelect(basePtr,  rtcUserCfg->clockPinSelect);
            RTC_HAL_SetLPOSelect(basePtr,       rtcUserCfg->clockSelect);
            RTC_HAL_SetUpdateMode(basePtr,      rtcUserCfg->updateEnable);
            RTC_HAL_SetSupervisorAccess(basePtr,
                                         rtcUserCfg->nonSupervisorAccessEnable);
    #if FSL_RTC_DEVICE_HAS_WAKEUP_PIN
            RTC_HAL_SetWakeupPinSelect(basePtr, rtcUserCfg->wakeupPinSelect);
            RTC_HAL_SetWakeupPinEnable(basePtr, rtcUserCfg->wakeupPinEnable);
    #endif

            /* Check if compensation needs to be updated */
            if((rtcUserCfg->compensation != 0) ||
                                        (rtcUserCfg->compensationInterval != 0))
            {
                RTC_DRV_ConfigureTimeCompensation(instance,
                    rtcUserCfg->compensationInterval, rtcUserCfg->compensation);
            }
        }

