arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/drivers/src/rtc/fsl_rtc_driver.c
    }

    return statusCode;
}

/*FUNCTION**********************************************************************
 *
 * Function Name RTC_DRV_Deinit
 * Description   This function deinitializes the RTC instance.
 * If the Control register is locked then this method returns RTC_STATUS_LOCKED.
 * In order to clear the CR Lock the user must perform a power-on reset.
 * Return        RTC_STAT_SUCCESS if the operation was successful, RTC_STAT_ERROR
 *               if there was a problem or RTC_STATUS_LOCKED if at least one
 *               register is locked
 *
 *END**************************************************************************/
rtc_status_t RTC_DRV_Deinit(uint8_t instance)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < RTC_INSTANCE_COUNT)
#endif

    rtc_status_t statusCode = RTC_STAT_SUCCESS;

    /* Check if the control register is locked. If true, the method cannot
     * continue.
     */
    if(RTC_HAL_isRegisterLocked
                        (g_rtcBase[instance], RTC_CTRL_REG_LOCK) == true)
    {
        statusCode = RTC_STAT_LOCKED;
    }
    else
    {
        /* Disable RTC instance's interrupts */
        INT_SYS_DisableIRQ(g_rtcIrqNumbers[instance]);
        INT_SYS_DisableIRQ(g_rtcSecondsIrqNb[instance]);
        /* Perform a software reset */
        RTC_HAL_SetSoftwareReset(g_rtcBase[instance]);
        RTC_HAL_ClearSoftwareReset(g_rtcBase[instance]);
        /* Clear the pending interrupt generated by the software reset */
        INT_SYS_ClearPending(g_rtcIrqNumbers[instance]);
    }

    return statusCode;
}

/*FUNCTION**********************************************************************
 *
 * Function Name RTC_DRV_CanWriteTCE
 * Description   This function checks the following conditions to find if the
 * Time Counter Enable bit is writable.
 *      - if Update Mode bitfield if 1 and:
 *          - Time is invalid or
 *          - Time Seconds Register has overflowed or
 *          - Time Counter is disabled,
 *      then the TCE bit can be set even if Status Register is locked.
 *
 *      This method is a private one, it is used only by the API internally.
 * Return  True if the TCE can be set, otherwise false
 *
 *END**************************************************************************/
static bool RTC_DRV_CanWriteTCE(uint8_t instance)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < RTC_INSTANCE_COUNT)
#endif

    bool result = false;
    /* Check if the status register is locked */
    if(RTC_HAL_isRegisterLocked(g_rtcBase[instance], RTC_STAT_REG_LOCK) == false)
    {
        result = true;
    }
    /* Get the Update Mode bit */
    else if(RTC_HAL_GetUpdateMode(g_rtcBase[instance]))
    {
        /* Check for the specified conditions */
        if(RTC_HAL_GetTimeInvalidFlag(g_rtcBase[instance])
                || RTC_HAL_GetTimeOverflowFlag(g_rtcBase[instance])
                || (RTC_HAL_GetTimeCounterEnable(g_rtcBase[instance]) == false))
        {
                result = true;
        }
    }

    return result;
}

/*FUNCTION**********************************************************************
 *
 * Function Name RTC_DRV_Enable
 * Description   This function sets the time and enables the time counter the
 * RTC instance with the time and date provided by the user via the startTime
 * parameter.
 * Return        RTC_STAT_SUCCESS if the operation was successful, RTC_STAT_ERROR
 *               if there was a problem or RTC_STATUS_LOCKED if at least one
 *               register is locked
 *
 *END**************************************************************************/
rtc_status_t RTC_DRV_Enable(uint8_t instance,
                            rtc_timedate_t * const startTime)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < RTC_INSTANCE_COUNT)
#endif

    rtc_status_t statusCode = RTC_STAT_SUCCESS;

    /* If the start time is NULL or it is not in a correct format,
     * return error
     */
    if((startTime == NULL) ||
            (RTC_DRV_IsTimeDateCorrectFormat(startTime) == false))
    {
        statusCode = RTC_STAT_ERROR;
    }
    /* Check if the TCE is writable and return corresponding status
     * if it is not
     */
    else if(RTC_DRV_CanWriteTCE(instance) == false)
    {
        statusCode = RTC_STAT_LOCKED;
    }
    else
    {
        uint32_t seconds = 0;
        /* Convert start time to seconds */
        RTC_DRV_ConvertTimeDateToSeconds(startTime, &seconds);
        /* Set start time */
        statusCode  =
                   RTC_HAL_SetTimeSecondsRegister(g_rtcBase[instance], seconds);

        /* If time setup was successful enable the counter */
        if(statusCode == RTC_STAT_SUCCESS)
        {
            statusCode  = RTC_HAL_Enable(g_rtcBase[instance]);
        }
    }

    return statusCode;
}

/*FUNCTION**********************************************************************
 *
 * Function Name RTC_DRV_Disable
 * Description   This function disables the current RTC instance
 * parameter.
 * Return        RTC_STAT_SUCCESS if the operation was successful, RTC_STAT_ERROR
 *               if there was a problem or RTC_STATUS_LOCKED if status
 *               register is locked
 *
 *END**************************************************************************/
rtc_status_t RTC_DRV_Disable(uint8_t instance)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < RTC_INSTANCE_COUNT)
#endif

    rtc_status_t statusCode = RTC_STAT_SUCCESS;

    /* Check if the TCE is writable */
    if(RTC_DRV_CanWriteTCE(instance) == false)
    {
        statusCode = RTC_STAT_LOCKED;
    }
    else
    {
        /* Disable the RTC instance */
        statusCode = RTC_HAL_Disable(g_rtcBase[instance]);
    }

    return statusCode;
}

/*FUNCTION**********************************************************************
 *
 * Function Name RTC_DRV_GetCurrentTimeDate
 * Description   This retrieves the current time and date from the RTC instance.
 * Data is saved into currentTime, which is a pointer of the rtc_timedate_t
 * type.
 * Return        RTC_STAT_SUCCESS if the operation was successful, RTC_STAT_ERROR
 *               if there was a problem.
 *
 *END**************************************************************************/
rtc_status_t RTC_DRV_GetCurrentTimeDate(uint8_t instance,
                                   rtc_timedate_t * currentTime)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < RTC_INSTANCE_COUNT)
#endif

    rtc_status_t statusCode = RTC_STAT_SUCCESS;
    uint32_t seconds, tempSeconds;

    if(currentTime == NULL)
    {
        statusCode = RTC_STAT_ERROR;
    }
    else
    {
        /* Make two consecutive reads to ensure that the read was not
         * done when the counter is incrementing.
         * This is recommended in the reference manual.
         */
        tempSeconds  = RTC_HAL_GetTimeSecondsRegister(g_rtcBase[instance]);
        seconds      = RTC_HAL_GetTimeSecondsRegister(g_rtcBase[instance]);
        /* If the read was done when the counter was incrementing,
         * try and read again.
         */
        if(tempSeconds != seconds)
        {
            tempSeconds = 0UL;
            tempSeconds = RTC_HAL_GetTimeSecondsRegister(g_rtcBase[instance]);
            if(tempSeconds != seconds)
            {
                /* If the last two reads are not equal, there is an error */
                statusCode = RTC_STAT_ERROR;
            }
            else
            {
                RTC_DRV_ConvertSecondsToTimeDate(&seconds, currentTime);
            }
        }
        else
        {
            RTC_DRV_ConvertSecondsToTimeDate(&seconds, currentTime);
        }
    }

    return statusCode;
}

/*FUNCTION**********************************************************************
 *
 * Function Name RTC_DRV_SetTimeDate
 * Description   This modifies the time and date of the RTC instance
 * type.
 * Return        RTC_STAT_SUCCESS if the operation was successful, RTC_STAT_ERROR
 *               if there was a problem, RTC_STAT_LOCKED if the TCE bit is not
 *               writable.
 *
 *END**************************************************************************/
rtc_status_t RTC_DRV_SetTimeDate(uint8_t instance, rtc_timedate_t * time)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < RTC_INSTANCE_COUNT)
#endif

    rtc_status_t statusCode = RTC_STAT_SUCCESS;

    /* Check if the time is in the correct format */
    if(RTC_DRV_IsTimeDateCorrectFormat(time) == false)
    {
        statusCode = RTC_STAT_ERROR;
    }
    /* Check if the TCE bit is writable */
    else if(RTC_DRV_CanWriteTCE(instance) == false)
    {
        statusCode = RTC_STAT_LOCKED;
    }
    else
    {
        uint32_t seconds = 0;
        /* Convert the desired time to seconds */
        RTC_DRV_ConvertTimeDateToSeconds(time, &seconds);
        /* Stop time counter */
        RTC_HAL_SetTimeCounterEnable(g_rtcBase[instance], false);
        /* Set the time */
        RTC_HAL_SetTimeSecondsRegister(g_rtcBase[instance], seconds);
        /* Re-enable the time counter */
        RTC_HAL_SetTimeCounterEnable(g_rtcBase[instance], true);

