arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/drivers/src/rtc/fsl_rtc_driver.c
        /* Check if the time is invalid */
        if(RTC_HAL_GetTimeInvalidFlag(g_rtcBase[instance]))
        {
            statusCode = RTC_STAT_ERROR;
        }
    }

    return statusCode;
}

/*FUNCTION**********************************************************************
 *
 * Function Name RTC_DRV_ConfigureRegisterLock
 * Description   This method configures register lock for the corresponding
 * RTC instance. Remember that all the registers are unlocked only by software
 * reset or power on reset. (Excepting CR that is unlocked only by POR).
 * Return        RTC_STAT_SUCCESS if the operation was successful,
 *               RTC_STAT_LOCKED if the Lock Register is locked.
 *
 *END**************************************************************************/
rtc_status_t RTC_DRV_ConfigureRegisterLock(uint8_t instance,
            const rtc_register_lock_config_t * const lockConfig)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < RTC_INSTANCE_COUNT)
#endif

    rtc_status_t statusCode = RTC_STAT_SUCCESS;

    /* Configure register lock */
    if(lockConfig->controlRegisterLock)
    {
        statusCode = RTC_HAL_ConfigureRegisterLock
                                    (g_rtcBase[instance], RTC_CTRL_REG_LOCK);
    }
    if(lockConfig->statusRegisterLock)
    {
            statusCode = RTC_HAL_ConfigureRegisterLock
                                    (g_rtcBase[instance], RTC_STAT_REG_LOCK);
    }
    if(lockConfig->timeCompensationRegisterLock)
    {
            statusCode = RTC_HAL_ConfigureRegisterLock
                                    (g_rtcBase[instance], RTC_TCE_REG_LOCK);
    }
    if(lockConfig->lockRegisterLock)
    {
            statusCode = RTC_HAL_ConfigureRegisterLock
                                    (g_rtcBase[instance], RTC_LOCK_REG_LOCK);
    }

    return statusCode;
}

/*FUNCTION**********************************************************************
 *
 * Function Name RTC_DRV_GetRegisterLock
 * Description   This retrieves the register lock configuration from the RTC
 * instance. Data is stored in the structure referenced by the lockConfig
 * pointer.
 * Return        None
 *
 *END**************************************************************************/
void RTC_DRV_GetRegisterLock(uint8_t instance,
                rtc_register_lock_config_t * lockConfig)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < RTC_INSTANCE_COUNT)
#endif

    lockConfig->lockRegisterLock = RTC_HAL_isRegisterLocked
                                    (g_rtcBase[instance], RTC_LOCK_REG_LOCK);
    lockConfig->controlRegisterLock = RTC_HAL_isRegisterLocked
                                    (g_rtcBase[instance], RTC_CTRL_REG_LOCK);
    lockConfig->statusRegisterLock = RTC_HAL_isRegisterLocked
                                    (g_rtcBase[instance], RTC_STAT_REG_LOCK);
    lockConfig->timeCompensationRegisterLock = RTC_HAL_isRegisterLocked
                                    (g_rtcBase[instance], RTC_TCE_REG_LOCK);

}

/*FUNCTION**********************************************************************
 *
 * Function Name RTC_DRV_ConfigureTimeCompensation
 * Description   This method configures time compensation. Data is passed by
 * the compInterval and compensation parameters.
 * For more details regarding coefficient calculation see the Reference Manual.
 * Return        RTC_STAT_SUCCESS if the operation was successful,
 * RTC_STAT_LOCKED if the TC Register is locked.
 *
 *END**************************************************************************/
rtc_status_t RTC_DRV_ConfigureTimeCompensation(uint8_t instance,
                                    uint8_t compInterval, int8_t compensation)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < RTC_INSTANCE_COUNT)
#endif

    rtc_status_t statusCode = RTC_STAT_SUCCESS;

    /* Check if the TCR is locked */
    if(RTC_HAL_isRegisterLocked
            (g_rtcBase[instance], RTC_TCE_REG_LOCK) == true)
    {
        statusCode = RTC_STAT_LOCKED;
    }
    else
    {
        /* Set the corresponding values for compensation and compensation
         * interval.
         */
        RTC_HAL_SetTimeCompensationRegister
                        (g_rtcBase[instance], compensation);
        RTC_HAL_SetCompensationIntervalRegister
                        (g_rtcBase[instance], compInterval);
    }

    return statusCode;
}

/*FUNCTION**********************************************************************
 *
 * Function Name RTC_DRV_GetTimeCompensation
 * Description   This retrieves the time compensation coefficients and saves
 * them on the variables referenced by the parameters.
 *
 * Return        None
 *
 *END**************************************************************************/
void RTC_DRV_GetTimeCompensation(uint8_t instance,
                                uint8_t * compInterval, int8_t * compensation)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < RTC_INSTANCE_COUNT)
#endif

    (*compInterval) = RTC_HAL_GetCompensationIntervalRegister
                                                        (g_rtcBase[instance]);
    (*compensation) = RTC_HAL_GetTimeCompensationRegister
                                                        (g_rtcBase[instance]);
}

/*FUNCTION**********************************************************************
 *
 * Function Name RTC_DRV_ConvertSecondsToTimeDate
 * Description   This method converts seconds into time-date format.
 *
 * Return        RTC_STAT_ERROR if one or both of the parameters are NULL,
 *               RTC_STAT_SUCCESS otherwise.
 *
 *END**************************************************************************/
rtc_status_t RTC_DRV_ConvertSecondsToTimeDate(const uint32_t *seconds,
                                                      rtc_timedate_t * timeDate)
{
    rtc_status_t statusCode = RTC_STAT_SUCCESS;

    /* Check if parameters are null, if yes return error */
    if((timeDate == NULL) || (seconds == NULL))
    {
        statusCode = RTC_STAT_ERROR;
    }
    else
    {

      /* Set the year to the beginning of the range */
      timeDate->year = YEAR_RANGE_START;

      /* Declare the variables needed */
      uint8_t i;
      bool yearLeap = false;
      uint32_t numberOfDays = 0U, tempSeconds;

      uint16_t daysInYear = DAYS_IN_A_YEAR;

