arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/drivers/src/rtc/fsl_rtc_driver.c
      /* Get the number of days */
      numberOfDays = (*seconds) / SECONDS_IN_A_DAY;
      /* Get the number of seconds remaining */
      tempSeconds = (*seconds) % SECONDS_IN_A_DAY;

      /* Get the current hour */
      timeDate->hour        = (uint16_t)(tempSeconds / SECONDS_IN_A_HOUR);
      /* Get the remaining seconds */
      tempSeconds           = tempSeconds % SECONDS_IN_A_HOUR;
      /* Get the minutes */
      timeDate->minutes     = (uint16_t)(tempSeconds / SECONDS_IN_A_MIN);
      /* Get seconds */
      timeDate->seconds = (uint8_t)(tempSeconds % SECONDS_IN_A_MIN);

      /* Get the current year */
      while (numberOfDays >= daysInYear)
      {
          /* Increment year if the number of days is greater than the ones in
           * one year
           */
          timeDate->year++;
          /* Subtract the number of the days */
          numberOfDays -= daysInYear;

          /* Check if the year is leap or unleap */
          if(!RTC_DRV_IsYearLeap(timeDate->year))
          {
              daysInYear = DAYS_IN_A_YEAR;
          }
          else
          {
              daysInYear = DAYS_IN_A_LEAP_YEAR;
          }
      }

      /* Add the current day */
      numberOfDays += 1U;

      if(RTC_DRV_IsYearLeap(timeDate->year))
      {
        yearLeap = true;
      }
      else
      {
        yearLeap = false;
      }

      /* Get the month */
      for (i = 1U; i<=12U; i++)
      {
        uint32_t daysInCurrentMonth = ((yearLeap == true) ?
                            (uint32_t)LY[i] : (uint32_t)ULY[i]);
        if(numberOfDays <= daysInCurrentMonth)
          {
              timeDate->month = (uint16_t)i;
              break;
          }
          else
          {
              numberOfDays -= daysInCurrentMonth;
          }

      }

      timeDate->day = (uint16_t)numberOfDays;
    }

    return statusCode;
}

/*FUNCTION**********************************************************************
 *
 * Function Name RTC_DRV_ConvertTimeDateToSeconds
 * Description   This method converts time-date into seconds.
 *
 * Return        RTC_STAT_SUCCESS if the conversion is completed, RTC_STAT_ERROR
 *               if any/both parameters are NULL
 *
 *END**************************************************************************/
rtc_status_t RTC_DRV_ConvertTimeDateToSeconds(rtc_timedate_t * timeDate,
                                                             uint32_t * seconds)
{
    rtc_status_t statusCode = RTC_STAT_SUCCESS;

    /* Check if parameters are null, if yes return error */
    if((timeDate == NULL) || (seconds == NULL))
    {
        statusCode = RTC_STAT_ERROR;
    }
    else
    {
      uint16_t year;

      /* Convert years to seconds */
      (*seconds) = (timeDate->year - YEAR_RANGE_START) * DAYS_IN_A_YEAR
                                                       * SECONDS_IN_A_DAY;

      /* Add the seconds from the leap years */
      for(year = YEAR_RANGE_START; year < timeDate->year; year++)
      {
          if(RTC_DRV_IsYearLeap(year))
          {
              (*seconds) += SECONDS_IN_A_DAY;
          }
      }

      /* If the current year is leap and 29th of February has passed, add
       * another day to seconds passed.
       */
      if((RTC_DRV_IsYearLeap(year)) && (timeDate->month > 2U))
      {
          (*seconds) += SECONDS_IN_A_DAY;
      }

      /* Add the rest of the seconds from the current month */
      (*seconds) += MONTH_DAYS[timeDate->month] * SECONDS_IN_A_DAY;
      /* Add the rest of the seconds from the current day */
      (*seconds) += (uint32_t)((timeDate->day - 1U) * SECONDS_IN_A_DAY);
      /* Add the rest of the seconds from the current time */
      (*seconds) += timeDate->hour * SECONDS_IN_A_HOUR + timeDate->minutes
                                         * SECONDS_IN_A_MIN + timeDate->seconds;
    }

    return statusCode;
}

/*FUNCTION**********************************************************************
 *
 * Function Name RTC_DRV_IsTimeDateCorrectFormat
 * Description   This method checks if date-time structure is in a correct
 * format
 *
 * Return        True if the following conditions are met:
 *                  - is a valid year, month and date
 *                  - is a valid time format
 *               False otherwise
 *
 *END**************************************************************************/
bool RTC_DRV_IsTimeDateCorrectFormat(const rtc_timedate_t * timeDate)
{
    bool returnCode = true;

    /* Check if the time and date are in the correct ranges */
    if((timeDate->year < YEAR_RANGE_START) || (timeDate->year > YEAR_RANGE_END)
        ||  (timeDate->month < 1U) || (timeDate->month > 12U)
        ||  (timeDate->day < 1U) || (timeDate->day > 31U)
        ||  (timeDate->hour > HOURS_IN_A_DAY)
        ||  (timeDate->minutes > 60U) || (timeDate->seconds > 60U))
    {
        returnCode = false;
    }
    /* Check if the day is a valid day from the corresponding month */
    else if(RTC_DRV_IsYearLeap(timeDate->year))
    {
        if(timeDate->day > LY[timeDate->month])
        {
            returnCode = false;
        }
        else
        {
            returnCode = true;
        }
    }
    else
    {
        if(timeDate->day > ULY[timeDate->month])
        {
            returnCode = false;
        }
        else
        {
            returnCode = true;
        }
    }

    return returnCode;
}

/*FUNCTION**********************************************************************
 *
 * Function Name RTC_DRV_IsYearLeap
 * Description   This method checks if the year passed as a parameter is a leap
 * one.
 *
 * Return        True if the year is leap, false if otherwise.
 *
 *END**************************************************************************/
bool RTC_DRV_IsYearLeap(uint16_t year)
{
    bool isYearLeap = false;

    if(year % 4U)
    {
        isYearLeap = false;
    }
    else if (year % 100U)
    {
        isYearLeap = true;
    }
    else if (year % 400U)
    {
        isYearLeap = false;
    }
    else
    {
        isYearLeap = true;
    }

