arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/drivers/src/rtc/fsl_rtc_driver.c
    return isYearLeap;
}


/*FUNCTION**********************************************************************
 *
 * Function Name RTC_DRV_IRQHandler
 * Description   This method is the API's Interrupt handler for generic and
 * alarm IRQ. It will handle the alarm repetition and calls the user callbacks
 * if they are not NULL.
 *
 * Return        None
 *
 *END**************************************************************************/
void RTC_DRV_IRQHandler(uint8_t instance)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < RTC_INSTANCE_COUNT)
#endif

    uint32_t tempSeconds;

    rtc_alarm_config_t * alarmConfig =
                                g_rtcRuntimeConfig[instance].alarmConfig;

    rtc_interrupt_config_t * intConfig =
                                g_rtcRuntimeConfig[instance].intConfig;

    /* Check if an alarm has occurred */
    if(RTC_HAL_GetTimeAlarmFlag(g_rtcBase[instance]) == true)
    {
        /* If the alarm interrupt configuration has been defined process the
         * alarm IRQ
         */
        if((alarmConfig != NULL))
        {
            /* If recurrence is enabled modify the alarm register to the next
             * alarm.
             */
            if((alarmConfig->numberOfRepeats > 0UL) ||
                                          (alarmConfig->repeatForever == true))
            {
                tempSeconds = RTC_HAL_GetTimeSecondsRegister
                                                          (g_rtcBase[instance]);
                tempSeconds += alarmConfig->repetitionInterval - 1;

                RTC_HAL_SetTimeAlarmRegister(g_rtcBase[instance],tempSeconds);

                /* Convert the next alarm time to time date */
                RTC_DRV_ConvertSecondsToTimeDate(&tempSeconds,
                                     &g_rtcRuntimeConfig[instance].
                                                        alarmConfig->alarmTime);
                g_rtcRuntimeConfig[instance].isAlarmTimeNew = true;
                /* If the alarm repeats forever, set number of repeats to 0
                 * to avoid an accidental trigger of the core overflow flag
                 */
                alarmConfig->numberOfRepeats =
                        (alarmConfig->repeatForever == false) ?
                                (alarmConfig->numberOfRepeats - 1UL) : 0UL;
            }
            else
            {
                /* If the alarm does not repeat, write 0 to TAR to clear the
                 * alarm flag.
                 */
                RTC_HAL_SetTimeAlarmRegister(g_rtcBase[instance], 0UL);
                g_rtcRuntimeConfig[instance].isAlarmTimeNew = false;
            }
            /* If the user has defined a callback, call it */
            if(alarmConfig->alarmCallback != NULL)
            {
                alarmConfig->
                    alarmCallback(alarmConfig->callbackParams);
            }
        }
    }
    /* If the IRQ is not caused by the alarm then call the user callback if
     * defined.
     */
    else if((intConfig->rtcCallback != NULL) && (intConfig != NULL))
    {
        intConfig->rtcCallback(intConfig->callbackParams);
    }

}

/*FUNCTION**********************************************************************
 *
 * Function Name RTC_DRV_SecondsIRQHandler
 * Description   This method is the API's Interrupt handler for RTC Second
 * interrupt. This ISR will call the user callback if defined.
 *
 * Return        None
 *
 *END**************************************************************************/
void RTC_DRV_SecondsIRQHandler(uint8_t instance)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < RTC_INSTANCE_COUNT)
#endif

    rtc_seconds_int_config_t * intCfg =
            g_rtcRuntimeConfig[instance].secondsIntConfig;

    /* If the interrupt is configured by the driver API and the user callback
     * is not NULL, then call it.
     */
    if((intCfg != NULL) || (intCfg->rtcSecondsCallback != NULL))
    {
        intCfg->rtcSecondsCallback(intCfg->secondsCallbackParams);
    }

}

/*FUNCTION**********************************************************************
 *
 * Function Name RTC_DRV_ConfigureInterrupts
 * Description   This method configures general interrupts such as:
 *                  - Time Overflow Interrupt
 *                  - Time Invalid Interrupt
 *               with the user provided configuration struct intConfig.
 *
 * Return        RTC_STAT_SUCCESS if the configuration is successful or
 *               RTC_STAT_ERROR if the configuration parameter is NULL.
 *
 *END**************************************************************************/
rtc_status_t RTC_DRV_ConfigureInterrupts(uint8_t instance,
                                        rtc_interrupt_config_t * intConfig)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < RTC_INSTANCE_COUNT)
#endif

    rtc_status_t statusCode = RTC_STAT_SUCCESS;

    /* Check if the configuration structure is not NULL */
    if(intConfig != NULL)
    {
        /* Disable the IRQ to avoid accidental interrupt requests */
        INT_SYS_DisableIRQ(g_rtcIrqNumbers[instance]);
        /* Save the configuration into the instance's runtime structure */
        g_rtcRuntimeConfig[instance].intConfig = intConfig;

        /* Enable or disable selected interrupts */
        RTC_HAL_SetTimeOverflowIntEnable(g_rtcBase[instance],
                                                intConfig->overflowIntEnable);

        RTC_HAL_SetTimeInvalidIntEnable(g_rtcBase[instance],
                                             intConfig->timeInvalidIntEnable);

        /* After the configuration is done, re-enable the interrupt in NVIC */
        INT_SYS_EnableIRQ(g_rtcIrqNumbers[instance]);
    }
    else
    {
        statusCode = RTC_STAT_ERROR;
    }

    return statusCode;
}

/*FUNCTION**********************************************************************
 *
 * Function Name RTC_DRV_ConfigureSecondsInt
 * Description   This method configures the Time Seconds Interrupt with the
 * configuration from the intConfig parameter.
 *
 * Return        RTC_STAT_SUCCESS if the configuration is successful or
 *               RTC_STAT_ERROR if the configuration parameter is NULL.
 *
 *END**************************************************************************/
rtc_status_t RTC_DRV_ConfigureSecondsInt(uint8_t instance,
                                    rtc_seconds_int_config_t * intConfig)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < RTC_INSTANCE_COUNT)
#endif

    rtc_status_t statusCode = RTC_STAT_SUCCESS;
    /* Check if the configuration structure is not NULL */
    if(intConfig != NULL)
    {
        /* Disable the IRQ to avoid accidental interrupt requests */
        INT_SYS_DisableIRQ(g_rtcSecondsIrqNb[instance]);
        /* Disable the IRQ to avoid accidental interrupt requests */
        g_rtcRuntimeConfig[instance].secondsIntConfig = intConfig;

        /* Configure the interrupt frequency */
        RTC_HAL_SetTimeSecondsIntConf
                        (g_rtcBase[instance], intConfig->secondIntConfig);

        /* Enable or disable Time Seconds interrupt */
        RTC_HAL_SetTimeSecondsIntEnable
                        (g_rtcBase[instance], intConfig->secondIntEnable);

