arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/drivers/src/rtc/fsl_rtc_driver.c
        /* After the configuration is done, re-enable the interrupt in NVIC */
        INT_SYS_EnableIRQ(g_rtcSecondsIrqNb[instance]);
    }
    else
    {
        statusCode = RTC_STAT_ERROR;
    }

    return statusCode;
}

/*FUNCTION**********************************************************************
 *
 * Function Name RTC_DRV_ConfigureAlarm
 * Description   This method configures the alarm with the
 * configuration from the alarmConfig parameter.
 *
 * Return        RTC_STAT_SUCCESS if the configuration is successful or
 *               RTC_STAT_ERROR if the configuration parameter is NULL.
 *
 *END**************************************************************************/
rtc_status_t RTC_DRV_ConfigureAlarm(uint8_t instance,
                                        rtc_alarm_config_t * alarmConfig)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < RTC_INSTANCE_COUNT)
#endif

    rtc_status_t statusCode = RTC_STAT_SUCCESS;

    /* Check if the configuration structure is not NULL */
    if(alarmConfig != NULL)
    {
        uint32_t seconds;
        /* Check if the alarm time is in a correct format */
        if(RTC_DRV_IsTimeDateCorrectFormat(&(alarmConfig->alarmTime)) == true)
        {
            /* Convert the time date to seconds */
            RTC_DRV_ConvertTimeDateToSeconds
                                        (&(alarmConfig->alarmTime), &seconds);
            /* Disable the IRQ to avoid accidental interrupt requests */
            INT_SYS_DisableIRQ(g_rtcIrqNumbers[instance]);
            /* Disable the IRQ to avoid accidental interrupt requests */
            g_rtcRuntimeConfig[instance].alarmConfig = alarmConfig;

            /* Write alarm time into Time Alarm Register */
            RTC_HAL_SetTimeAlarmRegister(g_rtcBase[instance], seconds);
            /* Enable/disable interrupt source based on the configuration */
            RTC_HAL_SetTimeAlarmIntEnable(g_rtcBase[instance],
                                                alarmConfig->alarmIntEnable);
            /* After the configuration is done, re-enable the interrupt in
             * NVIC.
             */
            INT_SYS_EnableIRQ(g_rtcIrqNumbers[instance]);
        }
        else
        {
            statusCode = RTC_STAT_ERROR;
        }
    }

    return statusCode;
}

/*FUNCTION**********************************************************************
 *
 * Function Name RTC_DRV_GetAlarmConfig
 * Description   This method retrieves the alarm configuration.
 *
 * Return        RTC_STAT_SUCCESS if the configuration exist or RTC_STAT_ERROR
 *               if the configuration is not available.
 *
 *END**************************************************************************/
rtc_status_t RTC_DRV_GetAlarmConfig(uint8_t instance,
                                        rtc_alarm_config_t * alarmConfig)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < RTC_INSTANCE_COUNT)
#endif

    rtc_status_t statusCode = RTC_STAT_SUCCESS;

    if(alarmConfig != NULL)
    {
        alarmConfig = g_rtcRuntimeConfig[instance].alarmConfig;
    }
    else
    {
        statusCode = RTC_STAT_ERROR;
    }

    return statusCode;
}

/*FUNCTION**********************************************************************
 *
 * Function Name RTC_DRV_IsAlarmPending
 * Description   This method specifies if an alarm has occurred.
 *
 * Return        True if an alarm has occurred, false if not.
 *
 *END**************************************************************************/
bool RTC_DRV_IsAlarmPending(uint8_t instance)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < RTC_INSTANCE_COUNT)
#endif

    return RTC_HAL_GetTimeAlarmFlag(g_rtcBase[instance]);
}

/*FUNCTION**********************************************************************
 *
 * Function Name RTC_DRV_GetNextAlarmTime
 * Description   This method retrieves the next alarm time;
 *
 * Return        RTC_STAT_SUCCESS if the next alarm time is valid,
 *               RTC_STAT_ERROR if there is no new alarm or alarm configuration
 *               specified.
 *
 *END**************************************************************************/
rtc_status_t RTC_DRV_GetNextAlarmTime(uint8_t instance,
                                                    rtc_timedate_t * alarmTime)
{
    rtc_status_t statusCode = RTC_STAT_SUCCESS;

    if((alarmTime != NULL) &&
                          (g_rtcRuntimeConfig[instance].isAlarmTimeNew == true))
    {
        (*alarmTime) = g_rtcRuntimeConfig[instance].alarmConfig->alarmTime;
    }
    else
    {
        statusCode = RTC_STAT_ERROR;
    }

    return statusCode;
}

#if FSL_RTC_DEVICE_HAS_WAKEUP_PIN
/*FUNCTION**********************************************************************
 *
 * Function Name RTC_DRV_AssertWakeUpPin
 * Description   This method specifies asserts the wake up pin.
 *
 * Return        None
 *
 *END**************************************************************************/
void RTC_DRV_AssertWakeUpPin(uint8_t instance)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < RTC_INSTANCE_COUNT)
#endif

    RTC_HAL_SetWakeupPinOn(g_rtcBase[instance], true);
}
#endif
